# SpaceConstructions Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSpaceConstruction..::..SpaceConstructions Property
MEPSpaceConstruction Class See Also
---
Return all the Space constructions of current space.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public MEPBuildingConstructionSet SpaceConstructions { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SpaceConstructions As MEPBuildingConstructionSet
	Get
```

Visual C++
---
```text
public:
property MEPBuildingConstructionSet^ SpaceConstructions {
	MEPBuildingConstructionSet^ get ();
}
```

# Remarks
If the name is same with the existing one, an exception will be thrown.
# See Also
MEPSpaceConstruction Class
Autodesk.Revit.DB.Mechanical Namespace